Tekla.Structures.Analysis.AnalysisModelConnectivityRule
The AnalysisModelConnectivityRule class contains information related to analysis model connectivity rules.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule._Group1
The group name 1 of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule._Group2
The group name 2 of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule._Status
The status of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule._MagneticDistance
The magnetic distance of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule._Linkage1
The linkage 1 of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule._Linkage2
The linkage 2 of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule.Group1
The group name 1 of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule.Group2
The group name 2 of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule.Status
The status of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule.MagneticDistance
The magnetic distance of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule.Linkage1
The linkage 1 of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule.Linkage2
The linkage 2 of the connectivity rule.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule.Select
Selects an analysis connectivity rule.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisModelConnectivityRule.SelectInstance
DO NOT USE! For internal usage only!